src/Reports/am_БалансСРасшифровкой/am_БалансСРасшифровкой.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>am_БалансСРасшифровкой</name>
  <attributes>
    <name>ЭтоОтчетУНФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

src/AccountingRegisters/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7cbb9946-2e19-4797-8ed4-d7a0ece334bb">
  <name>Управленческий</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <chartOfAccounts>Checked</chartOfAccounts>
  </extension>
  <chartOfAccounts>ChartOfAccounts.Управленческий</chartOfAccounts>
  <dimensions extendedConfigurationObject="82bc429e-f433-4291-8ee0-32be4e838c9a">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <balance>Checked</balance>
    </extension>
    <balance>true</balance>
  </dimensions>
  <dimensions extendedConfigurationObject="f67c3316-bdc1-461d-ac58-5b0759146baf">
    <name>СценарийПланирования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <balance>Checked</balance>
    </extension>
    <balance>true</balance>
  </dimensions>
  <dimensions extendedConfigurationObject="99f211b1-3ccc-4a3b-b494-76926ac4bbf2">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <balance>Checked</balance>
    </extension>
  </dimensions>
  <resources extendedConfigurationObject="d0b139bb-1ad7-4825-b238-e91efa2ba32b">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
    <balance>true</balance>
  </resources>
  <resources extendedConfigurationObject="7d8a6769-b06c-4d78-9274-f931b130408a">
    <name>СуммаВал</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="1f15454d-9657-4465-bbdd-a930a95a9660">
    <name>СуммаИнт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
    <balance>true</balance>
  </resources>
  <resources extendedConfigurationObject="70a495a4-965d-4c7c-a1bd-0f65042ef610">
    <name>СуммаВалИнт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="38f6382e-b801-4185-b096-eaf62c794186">
    <name>Содержание</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:AccountingRegister>

src/Enums/ТипыСчетов/ТипыСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9d8e09d4-753a-421c-a041-840d13ac7fdd">
  <name>ТипыСчетов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="5102918e-757b-4943-bf00-4cbc8df02998">
    <name>АмортизацияВнеоборотныхАктивов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b07d58b2-4574-40f5-acec-e6f2c74f18fb">
    <name>ВнеоборотныеАктивы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="046a8519-395f-4366-ac6c-ca27fa2407ec">
    <name>ГруппаСчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0c4c49bb-1b81-4602-8b39-d3564cf564a7">
    <name>Дебиторы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="8f3b1d03-64cd-462f-a1fe-950982f883c3">
    <name>ДенежныеСредства</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="da49f105-2268-408c-8de7-ef4634c0d729">
    <name>ДолгосрочныеОбязательства</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="81e75666-4e76-4851-955d-b5dc4845dec8">
    <name>Доходы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7c8e0707-68fb-4dce-a725-62e30f5e61a2">
    <name>Запасы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a7beb8e7-467a-4eaf-82fc-ee2e36cd8fee">
    <name>Капитал</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1d03d511-46e2-44e2-b308-74fd55844fd4">
    <name>КосвенныеЗатраты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="29da78ec-451a-461a-b5fb-42673e9f05d6">
    <name>КраткосрочныеФинансовыеВложения</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="677ef3a3-7629-4daa-a942-b0a6be1b0302">
    <name>Кредиторы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e8d30bfb-737f-4f81-be50-2c6b6f8aba28">
    <name>КредитыИЗаймы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="30ff5fcb-ef12-417f-9ceb-bdb1759e9131">
    <name>НалогНаПрибыль</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1afcd952-5525-4193-b0d9-ca932ae1cdc9">
    <name>НезавершенноеПроизводство</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e8453ad8-d31c-4389-9d97-bbc381f808a5">
    <name>НераспределеннаяПрибыль</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a21817d3-3640-48a3-986c-22a9e8c97a0d">
    <name>ПрибылиУбытки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b9972905-321f-431d-84a3-21e05583b5c7">
    <name>ПроцентыПоКредитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e2b59cf0-51c1-457c-a753-f3f10819216c">
    <name>ПрочиеВнеоборотныеАктивы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="27c88418-1caf-44b1-a909-5873a404ceb6">
    <name>ПрочиеДоходы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5ef74f61-b3f9-46c3-bde5-12c05060bd10">
    <name>ПрочиеКраткосрочныеОбязательства</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b1fd0eea-187c-473a-8e1c-695eb1dfabf4">
    <name>ПрочиеОборотныеАктивы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="70ee4c0b-2257-44f3-bfa4-d609a59160b3">
    <name>ПрочиеРасходы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3a3fbf65-51fa-4811-922b-b3ba02eca8bf">
    <name>Расходы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e63dcabb-67dd-4a56-b5d8-88622ebfe009">
    <name>РезервныйИДобавочныйКапитал</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9de512b2-bc36-4cf1-8ad5-cc21960673e6">
    <name>СебестоимостьПродаж</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b9f4608a-1b44-44ab-9d25-3453985c64df">
    <name>ТорговаяНаценка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/Reports/am_БалансСРасшифровкой/Forms/am_РасшифровкаЗапасы/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("Назначение") Тогда
		Отказ = Истина;
	КонецЕсли;
	

	Счет = Параметры.Назначение;
	ДатаНачала = Параметры.ДатаНачала;
	ДатаОкончания = Параметры.ДатаОкончания;
	Организация = Параметры.Организация;
	
	Макет = Отчеты.am_БалансСРасшифровкой.ПолучитьМакет("am_РасшифровкаЗапасов");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	
	РасшифровкаТабДок.Вывести(ОбластьШапка);
	
	Если Счет = "Переводы в пути" ИЛИ Счет = "Касса" ИЛИ Счет = "Банк" Тогда
		ЗаполнитьПоДенежнымСредствам(ДатаНачала, ДатаОкончания, Счет, Организация);
	Иначе
		ЗаполнитьПоСчету(ДатаНачала, ДатаОкончания, Счет, Организация);	
	КонецЕсли;	
	
	//РасшифровкаТабДок.АвтоМасштаб = Истина;
	//РасчетШириныКолонок(РасшифровкаТабДок);
КонецПроцедуры

Процедура ЗаполнитьПоСчету(ДатаНачала, ДатаОкончания, Счет, Организация)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	УправленческийОстаткиИОбороты.Счет КАК СчетЗапасы,
	               |	СУММА(УправленческийОстаткиИОбороты.СуммаКонечныйОстатокДт) КАК КонечныйОстаток,
	               |	СУММА(УправленческийОстаткиИОбороты.СуммаНачальныйОстатокДт) КАК НачальныйОстаток,
	               |	УправленческийОстаткиИОбороты.Организация КАК Организация,
	               |	УправленческийОстаткиИОбороты.Регистратор КАК Регистратор,
	               |	УправленческийОстаткиИОбороты.Период КАК Период,
	               |	УправленческийОстаткиИОбороты.СуммаОборот КАК СуммаОборот
	               |ИЗ
	               |	РегистрБухгалтерии.Управленческий.ОстаткиИОбороты(
	               |			НАЧАЛОПЕРИОДА(&ПериодНачало, День),
	               |			КОНЕЦПЕРИОДА(&ПериодКонец, День),
	               |			Регистратор,
	               |			,
	               |			Счет.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Запасы)
	               |				ИЛИ Счет.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство),
	               |			СценарийПланирования = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический)
	               |				И (Организация = &Организация
	               |					ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))) КАК УправленческийОстаткиИОбороты
	               |ГДЕ
	               |	УправленческийОстаткиИОбороты.СуммаКонечныйОстатокДт - УправленческийОстаткиИОбороты.СуммаНачальныйОстатокДт <> 0
	               |	И УправленческийОстаткиИОбороты.Счет.Наименование = &Счет
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	УправленческийОстаткиИОбороты.Счет,
	               |	УправленческийОстаткиИОбороты.Организация,
	               |	УправленческийОстаткиИОбороты.Регистратор,
	               |	УправленческийОстаткиИОбороты.Период,
	               |	УправленческийОстаткиИОбороты.СуммаОборот
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	УправленческийОстаткиИОбороты.Счет,
	               |	СУММА(-1 * УправленческийОстаткиИОбороты.СуммаКонечныйОстатокКт),
	               |	СУММА(-1 * УправленческийОстаткиИОбороты.СуммаНачальныйОстатокКт),
	               |	УправленческийОстаткиИОбороты.Организация,
	               |	УправленческийОстаткиИОбороты.Регистратор,
	               |	УправленческийОстаткиИОбороты.Период,
	               |	УправленческийОстаткиИОбороты.СуммаОборот
	               |ИЗ
	               |	РегистрБухгалтерии.Управленческий.ОстаткиИОбороты(
	               |			НАЧАЛОПЕРИОДА(&ПериодНачало, День),
	               |			КОНЕЦПЕРИОДА(&ПериодКонец, День),
	               |			Регистратор,
	               |			,
	               |			Счет.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ТорговаяНаценка),
	               |			СценарийПланирования = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический)
	               |				И (Организация = &Организация
	               |					ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))) КАК УправленческийОстаткиИОбороты
	               |ГДЕ
	               |	УправленческийОстаткиИОбороты.Счет.Наименование = &Счет
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	УправленческийОстаткиИОбороты.Счет,
	               |	УправленческийОстаткиИОбороты.Организация,
	               |	УправленческийОстаткиИОбороты.Регистратор,
	               |	УправленческийОстаткиИОбороты.Период,
	               |	УправленческийОстаткиИОбороты.СуммаОборот";
	
	Запрос.УстановитьПараметр("ПериодНачало", ДатаНачала);
	Запрос.УстановитьПараметр("ПериодКонец", ДатаОкончания);
	Запрос.УстановитьПараметр("Счет", Счет);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДобавитьСтрокуВТабДок(Выборка.Регистратор, Выборка.Период, Выборка.СуммаОборот, Выборка.НачальныйОстаток, Выборка.КонечныйОстаток, Истина);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДенежнымСредствам(ДатаНачала, ДатаОкончания, Счет, Организация)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	УправленческийОстаткиИОбороты.Счет КАК СчетДенежныеСредства,
	               |	УправленческийОстаткиИОбороты.СуммаКонечныйОстатокДт КАК КонечныйОстаток,
	               |	УправленческийОстаткиИОбороты.СуммаНачальныйОстатокДт КАК НачальныйОстаток,
	               |	УправленческийОстаткиИОбороты.Организация КАК Организация,
	               |	УправленческийОстаткиИОбороты.Регистратор КАК Регистратор,
	               |	УправленческийОстаткиИОбороты.Период КАК Период,
	               |	УправленческийОстаткиИОбороты.СуммаОборот КАК СуммаОборот
	               |ИЗ
	               |	РегистрБухгалтерии.Управленческий.ОстаткиИОбороты(
	               |			НАЧАЛОПЕРИОДА(&ПериодНачало, ДЕНЬ),
	               |			КОНЕЦПЕРИОДА(&ПериодОкончание, ДЕНЬ),
	               |			Регистратор,
	               |			,
	               |			Счет.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ДенежныеСредства),
	               |			СценарийПланирования = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический)
	               |				И (Организация = &Организация
	               |					ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))) КАК УправленческийОстаткиИОбороты
	               |ГДЕ
	               |	УправленческийОстаткиИОбороты.СуммаКонечныйОстатокДт - УправленческийОстаткиИОбороты.СуммаНачальныйОстатокДт <> 0
	               |	И УправленческийОстаткиИОбороты.Счет.Наименование = &Счет
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";
	
	Запрос.УстановитьПараметр("ПериодНачало", ДатаНачала);
	Запрос.УстановитьПараметр("ПериодОкончание", ДатаОкончания);
	Запрос.УстановитьПараметр("Счет", Счет);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДобавитьСтрокуВТабДок(Выборка.Регистратор, Выборка.Период, Выборка.СуммаОборот, Выборка.НачальныйОстаток, Выборка.КонечныйОстаток, Ложь);		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуВТабДок(Регистратор, Период, Оборот, НачальныйОстаток, КонечныйОстаток, ВыводитьКнопку)
	Макет = Отчеты.am_БалансСРасшифровкой.ПолучитьМакет("am_РасшифровкаЗапасов");	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ОбластьСтрока.Параметры.Период = Период;
	ОбластьСтрока.Параметры.Регистратор = Регистратор;
	Если Оборот < 0 ТОгда
		ОбластьСтрока.Параметры.Расход = Оборот;
	Иначе
		ОбластьСтрока.Параметры.Приход = Оборот;	
	КонецЕсли;
		
	ОбластьСтрока.Параметры.НачальныйОстаток = НачальныйОстаток;
	ОбластьСтрока.Параметры.КонечныйОстаток = КонечныйОстаток;
	
	ОбластьСтрока.Параметры.РегистраторРасшифровка = Регистратор;
	
	СтруктураРасшифровки = Новый Структура;
	СтруктураРасшифровки.Вставить("Регистратор", Регистратор);
	
	РасшифровкаТабДок.Вывести(ОбластьСтрока);
КонецПроцедуры

Процедура РасчетШириныКолонок(ТабличныйДокумент)
	
	Перем МаксимальноеКоличествоСтрок, МаксимальнаяШиринаКолонки;
	Перем КонечнаяСтрока, НачальнаяСтрока, ТекущаяКолонка, ТекущаяСтрока, НачалоДанных;
	Перем ОбластьШапки, ОбластьПодвала;
	Перем ШиринаКолонки, ТекстЯчейки, НомерСтрокиТекста;
	Перем КоличествоУровнейГруппировокСтрок, Отступ;
	Перем ШириныКолонок;
	
	// Максимальное количество строк отчета, которые будут использованы для расчета ширин колонок
	МаксимальноеКоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы;
	// Ограничение максимальной ширины колонки
	МаксимальнаяШиринаКолонки = 20;
	// Массив, в который будут помещаться ширины колонок
	ШириныКолонок = Новый Массив;
	// Получим количество уровней группировок в отчете для учета автоматического отступа
	КоличествоУровнейГруппировокСтрок = ТабличныйДокумент.КоличествоУровнейГруппировокСтрок();
	
	// Инициализируем начальные строки
	НачальнаяСтрока = 1;//с 1 строки табличного документа начинается вывод данных в таблицу, у вас может таблица начинаться с другой строки, например если выводятся еще отборы и заголовок в отчете
	НачалоДанных = 1;
	КонечнаяСтрока = НачальнаяСтрока + МаксимальноеКоличествоСтрок;
	// Ограничим конечную строку
	КонечнаяСтрока = Мин(КонечнаяСтрока, ТабличныйДокумент.ВысотаТаблицы);
	
	// Переберем все колонки отчета
	Для ТекущаяКолонка = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
		
		АвтоОтступ = 0;
		
		// Переберем строки, которые будут использованы для расчета ширин колонок
		Для ТекущаяСтрока = НачальнаяСтрока По КонечнаяСтрока Цикл
			
			ШиринаКолонки = 0;

			// Получим область текущей ячейки
			ОбластьЯчейки = ТабличныйДокумент.Область(ТекущаяСтрока, ТекущаяКолонка);
			
			Если ОбластьЯчейки.Лево <> ТекущаяКолонка Или ОбластьЯчейки.Верх <> ТекущаяСтрока Тогда
				
				// Данная ячейка принадлежит объединенным ячейкам и не является начальной ячейкой
				Продолжить;
				
			КонецЕсли;
			
			Если КоличествоУровнейГруппировокСтрок > 0 И ТекущаяСтрока = НачалоДанных Тогда
				
				// Для первой строки с данными получим значение автоотступа
				АвтоОтступ = ОбластьЯчейки.АвтоОтступ;
				
			КонецЕсли;
			
			// Получим текст ячейки
			ТекстЯчейки = ОбластьЯчейки.Текст;
			
			// Для каждой строки из текста ячейки рассчитаем количество символов в строке
			Для НомерСтрокиТекста = 1 По СтрЧислоСтрок(ТекстЯчейки) Цикл
				
				ШиринаТекстаЯчейки = СтрДлина(СтрПолучитьСтроку(СокрЛП(ТекстЯчейки), НомерСтрокиТекста));
				
				// Если используется автоотступ, то прибавим к ширине ячейки его величину
				Если АвтоОтступ <> Неопределено И АвтоОтступ > 0 Тогда
					
					ШиринаТекстаЯчейки = ШиринаТекстаЯчейки + КоличествоУровнейГруппировокСтрок * АвтоОтступ;
					
				КонецЕсли;
				
				ШиринаКолонки = Макс(ШиринаКолонки, ШиринаТекстаЯчейки);

			КонецЦикла;

			Если ШиринаКолонки > МаксимальнаяШиринаКолонки Тогда
				
				// Ограничим ширину колонки
				ШиринаКолонки = МаксимальнаяШиринаКолонки;
			КонецЕсли;
			
			Если ШиринаКолонки <> 0 Тогда
				// Ширина колонки рассчитана
				
				// Определим, сколько ячеек по ширине используется в области для текущей ячейки
				КоличествоКолонок = ОбластьЯчейки.Право - ОбластьЯчейки.Лево;
				
				// Переберем все ячейки, расположенные в области
				Для НомерКолонки = 0 По КоличествоКолонок Цикл
					
					Если ШириныКолонок.ВГраница() > ТекущаяКолонка - 1 + НомерКолонки Тогда
						
						// В массиве ширин колонок уже был элемент для текущей колонки
						
						Если ШириныКолонок[ТекущаяКолонка - 1 + НомерКолонки] = Неопределено Тогда
							// Значение ширины колонки еще не было установлено
							
							ШириныКолонок[ТекущаяКолонка - 1 + НомерКолонки] = ШиринаКолонки / (КоличествоКолонок + 1);
							
						Иначе
							// Значение ширины колонки уже было установлено
							// Вычислим максимум ширины колонки
							ШириныКолонок[ТекущаяКолонка - 1 + НомерКолонки] = 
								Макс(ШириныКолонок[ТекущаяКолонка - 1 + НомерКолонки], ШиринаКолонки / (КоличествоКолонок + 1));
							
						КонецЕсли;
						
					Иначе
						
						// В массиве ширин колонок еще не было элемента для данной колонки
						// Добавим элемент в массив ширин колонок
						ШириныКолонок.Вставить(ТекущаяКолонка - 1 + НомерКолонки, ШиринаКолонки / (КоличествоКолонок + 1));
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;	// Конец цикла перебора строк
		
	КонецЦикла;	// Конец цикла перебора колонок
	
	// Переберем все элементы в массиве вычисленных ширин колонок
	Для ТекущаяКолонка = 0 По ШириныКолонок.ВГраница() Цикл
		
		Если ШириныКолонок[ТекущаяКолонка] <> Неопределено Тогда
			// Ширина колонок установлена
			// Установим ширину области ячеек
			ТабличныйДокумент.Область(, ТекущаяКолонка + 1, НачалоДанных, ТекущаяКолонка + 1).ШиринаКолонки = ШириныКолонок[ТекущаяКолонка] + 1;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	ПоказатьЗначение(, Расшифровка);	

КонецПроцедуры
